#Реализовать алгоритм перемешивания списка
import random
x = list(range(1, 9))
random.shuffle(x)
print(x)
